[
  {
    "year": 1941,
    "day_month": "April 20",
    "headline": "Cow Palace opens",
    "text": "The $3 million Cow Palace, officially known as the Grand National Livestock Pavilion, opened to the public with “the finest collection of blooded Holstein stock ever assembled in this continent.” The cattle auction was a success, but the public use of the facility would be limited. After the bombing of Pearl Harbor later in 1941, the Cow Palace would be used for years as a troop assembly center for the military.",
    "wcm_image_id": 3574744,
    "photographer": "Chronicle file photo"
  },
  {
    "year": 1950,
    "day_month": "Aug. 5",
    "headline": "Feinstein runs for Livestock Queen",
    "text": "Dianne Feinstein would have many political victories in San Francisco and beyond. But her first run for Junior Grand National Livestock Exposition queen was not one of them. (Trivia: Feinstein lost to Bette Sherwood, who is not in the U.S. Senate.) Then known as Dianne Goldman, the future mayor and senator was a junior in high school competing against college students. She lost that race, but a year later was named queen of the Cow Palace horse show.",
    "wcm_image_id": 12085532,
    "photographer": "Chronicle archives"
  },
  {
    "year": 1951,
    "day_month": "Feb. 23",
    "headline": "Joe Louis beats Andy Walker",
    "text": "Arguably the greatest boxer in history, Joe Louis, fought at the Cow Palace twice in the twilight of his career. He beat Andy Walker in a 10th round technical knockout, and returned to Daly City several months later to outpoint Argentinian boxer Cesar Brion for a unanimous decision. Another greatest-ever boxing candidates, Sugar Ray Robinson, fought at the Cow Palace in 1955."
  },
  {
    "year": 1955,
    "day_month": "Dec. 30",
    "headline": "Ann Calvello joins the Roller Derby",
    "text": "Derby had been a fixture at the Cow Palace for years. But we’re choosing the eve of New Year’s Eve in 1955 as the catalyst for the golden era of derby at the Cow Palace, which would become the epicenter of the derby world. That was the debut of bad girl of Bay Area derby legend Ann Calvello, the most famous derby villain of her generation. Calvello was the 49ers ticket-taker later in life and died in 2006. RIP Demon of the Derby.",
    "wcm_image_id": 8630941,
    "photographer": "Chronicle file photo"
  },
  {
    "year": 1960,
    "day_month": "Nov. 2",
    "headline": "John F. Kennedy rallies for support",
    "text": "“I come here tonight and I ask your support in picking this country up and moving it forward,” Kennedy said to an assembled crowd. The future president was one of many great American orators who gave speeches at the Cow Palace. Martin Luther King, Jr. spoke at the facility at least twice, including to a group of Republicans before their national convention in 1964.\n",
    "wcm_image_id": 8973645,
    "photographer": "Associated Press photo"
  },
  {
    "year": 1963,
    "day_month": "May. 7",
    "headline": "Seals win WHL title",
    "text": "The San Francisco Seals won the Bay Area its first-ever pro hockey title, coming back from a 3-1 deficit to beat the Seattle Totems for the World Hockey Association title. Because of scheduling issues, all seven games were played at the Cow Palace. The Seals won a second championship the following year.",
    "wcm_image_id": 12086212,
    "photographer": "Photo: Barney Peterson/The Chronicle"
  },
  {
    "year": 1964,
    "day_month": "Jul. 16",
    "headline": "Republicans return",
    "text": "The Republican convention first arrived at the Cow Palace in 1956, when Dwight Eisenhower and a young Dick Nixon were nominated to the winning Republican ticket. But we’re choosing the Barry Goldwater year in 1964, when a 17-year-old Mitt Romney was on the floor of the convention center with the Michigan contingent. (The Chronicle captured him in several photos, which we dug up during his 2012 presidential run.)",
    "wcm_image_id": 3480765,
    "photographer": "Photo: Ken McLaughlin/The Chronicle"
  },
  {
    "year": 1964,
    "day_month": "Aug. 19",
    "headline": "The Beatles begin tour",
    "text": "The 1966 Candlestick Park appearance by the Fab Four is the one for the history books; the final public performance by the band. But it was also an awful concert, with bad sound and only a half hour of music. Time machine owners would be better to visit the band’s greatest Bay Area performance, at the Cow Palace. It was the beginning of their North America tour, and the Palace was packed with screaming (and many fainting) fans.\n",
    "wcm_image_id": 10702889,
    "photographer": "Chronicle file photo"
  },
  {
    "year": 1972,
    "day_month": "March 3",
    "headline": "Evel Knievel jumps 15 cars",
    "text": "“Sure I drink a lot and buy a lot of drinks. I also chase a lot of women,” Evel Knievel told a Chronicle reporter, moments after answering the door to his hotel room in his underwear and slipping on a purple smoking jacket. Hours later, after playing a round of golf, Knievel would launch himself over 15 cars – skidding into a post and shattering his ankle because the Cow Palace was much to small for his jump.",
    "wcm_image_id": 3574718,
    "photographer": "Photo: Jerry Telfer/The Chronicle"
  },
  {
    "year": 1973,
    "day_month": "Nov. 20",
    "headline": "The Who gets a new drummer",
    "text": "The greatest legend of the Cow Palace happened in 1973, when young San Francisco State student Scot Halpin briefly became the drummer of The Who. While the band was on the Quadrophenia tour, drummer Keith Moon passed out twice at the drums, and couldn’t be revived the second time. Halpin was recruited from the crowd, and played three songs with the remaining members of the band."
  },
  {
    "year": 1975,
    "day_month": "Feb. 15",
    "headline": "Wrestlers stage battle royale",
    "text": "The Cow Palace was always a home for wrestling theatrics, from the 1950s to WWF Wrestlemania and other events in the 1980s, 1990s and 2000s. This 1975 18-man Battle Royale was special though, bridging some of the older stars (Haystack Calhoun and Ray Stevens) with newer wrestlers – including the first Bay Area appearance by Andre the Giant. Jimmy “Superfly” Snuka would battle at the Cow Palace three years later, and Hulk Hogan and Rowdy Roddy Piper arrived after that.",
    "wcm_image_id": 12085529,
    "photographer": "Chronicle archives"
  },
  {
    "year": 1975,
    "day_month": "May. 20",
    "headline": "Warriors win Game 3",
    "text": "A year after losing star Nate Thurmond, nobody expected the Golden State Warriors to win a championship. Owner Franklin Mieuli was so sure that he scheduled the Ice Follies at the Oakland Coliseum Arena during finals time, forcing the basketball team to play at the Cow Palace. (A Cow Palace kung-fu exhibition further altered the schedule, bumping Game 3 back a day.) The Washington Bullets went ahead 28-19, but Rick Barry scored 36. The Warriors took a 3-0 series lead and won the fourth in Washington D.C.",
    "wcm_image_id": 2978550,
    "photographer": "Chronicle file photo"
  },
  {
    "year": 1985,
    "day_month": "Feb. 27",
    "headline": "Prince arrives on “Purple Rain” tour",
    "text": "Most cities got one or two days to spend with Prince on the biggest tour of his career. Daly City and the Cow Palace received six. Prince played sold out shows that were critically acclaimed, in one of the greatest concert years for the Cow Palace. U2 came through for an epic “The Unforgettable Fire” tour appearance three months later, Neil Diamond had a big show, and Van Halen made its first appearance with Sammy Hagar on the “5150” tour.",
    "wcm_image_id": 9872113,
    "photographer": "Photo: Steve Ringman/The Chronicle"
  },
  {
    "year": 1991,
    "day_month": "Oct. 5",
    "headline": "Sharks play first game",
    "text": "The San Jose Sharks’ superstars were rookie Pat Falloon and aging defenseman (and current Sharks general manager) Doug Wilson. Their most memorably player was arguably goon Link Gaetz, who racked up 326 penalty minutes. And because their home ice in San Jose wasn’t ready yet, the Sharks played their first season at the Cow Palace. The franchise opener was a 5-2 loss to Vancouver but the team finished an impressive 14-23-3 at home – aided by small home ice that helped the team’s hard-hitting playing style.\n",
    "wcm_image_id": 10151752,
    "photographer": "Photo: Brant Ward/The Chronicle"
  },
  {
    "year": 1998,
    "day_month": "Oct. 24",
    "headline": "Exotic Erotic Ball",
    "text": "Perry Mann’s Exotic Erotic Ball had been going strong since 1979 in smaller locations, but the highest-profile party was arguably in 1998, when guests included Dennis Rodman (still playing with the Chicago Bulls), Grace Jones, a performance from Joan Jett and the Blackhearts and porn queen Nina Hartley. The event was on pay-per-view and then-mayor Willie Brown was scheduled to perform a wedding ceremony. (We have no confirmation that it actually happened.)"
  },
  {
    "year": 2016,
    "day_month": "Oct. 5",
    "headline": "U2 Dreamforce concert",
    "text": "The Cow Palace has become less of a concert space and more of a convention hall in recent decades, with bigger acts playing at the Oracle Arena, SAP Center in San Jose and even AT&T Park. But the Cow Palace got at least one more huge show, when Bay Area native Marc Benioff scheduled U2 at the Cow Palace during Dreamforce 2016 - a fundraiser for UCSF Children's Hospitals.",
    "wcm_image_id": 11360372,
    "photographer": "Catherine Bigelow/Special to the Chronicle"
  }
]